## ピボットテーブル

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [2]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# 性別でグループ化して生存率を算出
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [4]:
# 性別と旅客等級を合わせた生存状況
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### ピボットテーブルの文法
DataFrameのpivot_tableメソッドを使用して、先の例と同じ操作を行う。

In [5]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [10]:
titanic.pivot_table('survived', index='sex', columns='class', aggfunc='std')

class      First    Second     Third
sex
female  0.176716  0.271448  0.501745
male    0.484484  0.365882  0.342694

#### 多重ピボットテーブル
ピボットテーブルのグループ化は複数のレベルで指定できる。<br>
例えば、年齢を３番目の次元とした分類を行う場合、<br>
ここでは、pd.cut関数を使用して年齢で分類する。

In [13]:
age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [14]:
# 列に対する分割も同様
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

#### その他のピボットテーブルオプション
```python
    DataFrame.pivot_table(data, values=None, index=None, columns=None,
                                aggfunc='mean', fill_value=None, margins=False,
                                dropna=True, margins_name='All')
```
aggfuncキーワードには集約を実装する関数（np.sum(),min(),sum()など）またはそれらの文字列表現（'sum', 'mean', 'count'など）<br>
さらにこれらの選択肢を列にマッピングする辞書を指定できる

In [15]:
titanic.pivot_table(index='sex', columns='class',
                                   aggfunc={'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [16]:
# 各グループに沿った合計を加える場合
titanic.pivot_table('survived', index='sex',columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838